import styles from './styles.module.css';

type DocumentProps = {
  onEnd?: () => void;
};

export default function Document({ onEnd }: DocumentProps) {
  return (
    <div className={styles.Document} onClick={onEnd}>
      <span className={styles.red}>
        This program is designed to self diagnose the B.E.B. addiction. Please
        use in caution.
      </span>
      <br />
      <br />
      <span className={styles.yellow}>
        The B.E.B. is a newly reported drug that is said to be distributed
        through fish(carp)-shaped bread, widely known in South Korea.
        <br />
        The symptoms are as follows:
        <ul>
          <li>Fear of fish or fish-shaped objects</li>
          <li>Confusion of primary colors</li>
          <li>Hallucinations</li>
          <li>D̶̨̛̩̼͖̗͌̔̔̉̆̏̕͝é̵̡̖͙͓̝͓̖͌̾͆ą̵͉̬̤̰̭͙̠̩͚̲̠̗͌̈́͒̊͐͆̌̃̔̀̏͜t̴͚̐͆͆̎̿̎̒̀͊͌̎͝͝h̷̥̬̜̙̼̬̙̝͂̉͂̐̓̓̈́̏̀̊̕</li>
        </ul>
        <br />
        <br />
        <br />
        <br />
        <br />
      </span>
      <span className={styles.blue}>
        The recipe of the B.E.B. is known to be very simple. Put the ingredients
        below in the mold:
        <br /> ṟ̷̡̨̧̲̫̲̫̘͖̠̞̥̤͇̠̙̣̹̤͖̦͍͉̞̠͙͕͖̫̠͓̝͓̻͙͙̗̙̱̠͆̉͐̏̓̈́̉̎̇͊̈̔̃̒̐̕͠ͅͅͅͅę̴̧̨̨̬̳͔͉̹̭͉̬̥̟̫͎̞̬̘̖̞̻̹̬̲̟̜̝͇͓͎̰͒̐̅̎̉͛̔͊͘͘͜͜͠ͅͅd̷̨̨̨̛̖̹̝͓͕̝̙͎̮̞̻̠͔̺̼͉͙̩̜̺̼̠͙͕̠͙̗͉͍̺͇̟̯̥͔̉͋̋̐͂̄̓̌͊̈͋̊́̅̀̍̑̇͑̋͌̄͐̆̔̄̅̎̽̀̇̽͑̕͜͠͝͝ͅ ̷̧͈̤̩̰̯͎͎̦̥̎́͌͋̾͆͆͂͆̑̾̿̆̒̇̓̋̋͝͝b̶̘̮̲̙͕̤͖̫͔̮̮̆͗̓̊͒̇̀͆̏̈́̈́͛̓̎̋͆̋̽̑́͘͜e̷̹͑͑̍͋̈́͑̋̊͋̈́̆̀͝ą̵̨̡̻̝̘̍͝n̷̢̧̛͈̹̦̪̬̭͓̖̫̜͇̳͙̘̞͚̰̬̲̰̻̺̄̓̋̇̍̎̑̀̒͋̅͊͊̒̽̌͐͊̋̏̓̇͐́̀̄̉͂̒̽͘͜͠͝ͅş̵̡̧̱͖̬͙̘̩̣̘͈̹͙̪͍͉̯͔̱̝̙̹̹̹̣̱̹̉̏͂͒̀̒̅́̀̈́̿̋͠ ̶̨̡̡͍͎̻̬̳̤͇̦̪͎̜͖̯̱̲̜͍̻͖͎͖͔̝͕̲̞̠̥̲̳͔͎̱͕̬̰̭̩̲̄̀̊̄̆̈́͑͌̑́͋͂̑͆̐̒̒͆͠ͅṕ̴̥̼̽̍͋͆̀̋̾̀̄̂̏̒̀̓̒̊́͌̽͐̓̀̅̊̀̉̊͊̌́͛̔̽͌͑̽̒͘͝͝͠͝͝ą̸̡̛̤̩͔̫͙͈͈̠̮̥͕̬̥̲̩̲̱̥̗̭̫̮̣͙͛͐̀͊̈͂̑̃̑͗̔̔̒̒̑͂̌͑̐̑͊͂̾̇̾̍̆͗̽̂͛̎̏̋͒͐͛̐̓̓̊̓͘͘͘̚͝͝͝ͅş̶̢̡̧̧̜̘͖̜͉͓̠͖̭͓̼̖̘͈͙̜̳̜͚͙̦͚̬̯̺͇͎͇̗̹̹̺̝͕̓͋͊͛͆̾̕͘͜͝ẗ̴̡̡̡̨̨̨̢̡̩̜͍͓̱͔̩̯̬̲̬̖̙͚̘͕̲̩̜͖̹̖̰̙̜͖̗̤̰̮̤̮̦͇̋̍́͋̉̅̈͜͠ͅę̵̛̥̞̦̥̩̟̾̊͋̓̉͊̄̉́͗̃͋̂̾̎͌́̒̑̍͛̈͝͝͠ͅ,̴̧̡̢̡̢̯̝͕̺̳̪̻̪̗͉͇̣̝̣͓̬͚̬̦͖͕͉̞̭̝͇̜͇͕̳̤͕̳̤̰̱̝̤͚̀͗̽̈́͐̇͒̽̍͜͜ͅͅ ̵̧̛̛̛̱̠̱̬̰̮̥̳̠̬͖̺̮̙̦̘̪̖͒̐̂̆͋̀̾̽͛̎͂̓̆̏͗̅̑̽̏͌̄̂̌̎̉̒͐̍̊̅̀͗͗̕͘̚͘̕͜͝͝c̸̡̛̜̰̙͚̙̩̗̥͈͔̺̞̞̲̱̎͂̒̃̎͆͛̾͌̏͌͌̍́̇̚̕̕h̸̢̨̡̢̤̲̯̝̬͍͚̻̜͇͙͎͎̗̰̞̥̥̮͉̥̩̩̤͔͍̹̙̬͓̜̭̻̝̃̾́̆́̀̒̽́̂͑͒̓̑̃̍̅̓̀͊̉͐͐̀̈́͋̆̒̕̚͘̕͜͝͝͠͝ͅơ̷̧̖̲͙̻͙̣̹̣̞̰͇̾́̿̅̓͒́̃͂̃̑͑̉́̈̕̚͝͠ͅư̷̡̢̡̠̯̭̱͍̫͕̩̤͉̫͙̘̘̺̟̳̩̩̺̟̯͙͖͚͇̥̩̭̞̼̬͚͙̜̯̠̭̐̽̊̆̀̀͗̿͗̈̿͗͊̀͂̊̓̋͑̇͊̏̐́̽̍͗̅̍͋̀͆͐͆͒̊̿̕͘͘̕͘͜͜͜͜͝͝͠ͅx̷̧̨̢̢̨̥̖̪̗̭̜̲̺͕͈̲͈̜͍͎̳̼̠͉̲̰͚̬͚̰̦̙̦̣̌̏̿̈̇̾̆̂́̉̒̌͐̄̌͐̅̈́̊͂̔̾̂̅̈́̎͌̈̅͛̚̚̚͜͝ͅ ̵̧̲̩̳̦̦̝̞̬̱̦̤̯̼̭̰̠̮̝͙̈́̽̊̈̓͐̓̽̆̆͒̈́͌̋̇͌̑̈̇̑̌̉̒̽͂̄̆́̽̒͗̓́̓̋̌̎̋͂̆̈́̕͘͘͠͝͝c̸̣̃̾͗ͅŗ̸̪̼̟͍͎̞̥͙̠̫̦̬̜̱̦͉̥̬̹̺̪̙̮̟̹̼̙̪̱͇̱͕̄́̊̂͋̍̀̓̃̇̌̂ȩ̴̧̨̫̻̻̟̙̹͙̟͚͖̟̟͒͌̓̈́͆̊̈́͂͆̌̆̅̂̌̈́̽̽̊̿̕̕͝͝͠a̶̢̡̢̨̙̱̰͈͉̼̲̼̤̻̭͉͖͇͎͇̦͍͈͕̪͚̯͍͈̖̮̘̗̣̖̜͓̽̃̾͋̽̎̈̓̉̀̉̂͌̓̏͒͑̄̇̑̾̽̓̓̊̒͗̓͑͘̚͜ͅͅm̸̧̧̨̢̧̡̫̠̩̺͉͕̻̬͉̫̰̳͚͔̣̟̱̦͓͙̭̹̰̗̥͔̗͙̖͐̈͗̔̉͐̅̂̈́̅́͊̔͛̽̕̕͠ͅ,̸̡̡̠̳̦̻͖̙̹͔͉̞̫̪̩̼̰͎̤̰̗͔̇̈̓̏͌̂̌̈̅̚ͅ ̴̧̢͙͚̫͈̣͖͚̓̑̀͊͊̾̕͝p̸̨̧̬̠̠̟̫͎̗̜͎͔̲̦̮̈́̈͛̈́͂́̾͜͠i̸̧̨̨̧̡̡̳̠̼͕̖̜͕͚͇̬̜̮̰̯̯̭̤̲̥͈̠̟̘̭͔̺̼̬̞̩̳̦̯͍̞̩͚̪̅̇͆̈̀̆̐͒̍̄̋̽̿̓̆̔̑̒̈̈́̔̾̐͐͊̆͘͠͠͠͝z̵̛͚̏̑̀̀͆̏̒͋̔̌̋̓̓͋̇̿͑͑̔́͊͌̐̒̀̇̃̏̀̌́͗͗̇̽͘̕͝͝z̴̢̘͍̭̹̼̮͉͖̖̪͓͌̎̉̍̽̊̅̔̋͗̽̍͊͊̂́̓̀͗́̊́̾̔̔͛͘̕̚͘ͅá̴̧̧̧̘̱̹͎̼͊͋̂̏̈́͗͠ͅ,̷̹̻͓̘̐̅̌̓̓̇̏̑̀͆̍̉̓̾͛͑͗͆̄̓̎̈́̈̏͆͂̃̈́̓͗̈̔̄͐͒̈́͑̓̂̿̎͝͝͝ ̵̧̛̦̝̠͉͙̪͍̻̗͙̰̰̠̳̜͖̣͐̾̉̎͗̄̌̉̈͂̌͑̆̑͛͑͋̊̓̈́̂̓̽̄͗̎̿͒̆͌́̈́̿̅̒̈́̉̐͘̚͜͝͝
      </span>
    </div>
  );
}
